pumpkin-patch/app/controllers/pumpkins_controller.rb

  def index
    @pumpkins = Pumpkin.all
---
SELECT "pumpkins".* FROM "pumpkins"

  def show
    @pumpkin = Pumpkin.find(params[:id])
---
SELECT "pumpkins".* FROM "pumpkins" WHERE "pumpkins"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]

  def create
    @pumpkin = Pumpkin.create(pumpkin_params)
---
INSERT INTO "pumpkins" ("species", "created_at", "updated_at") VALUES (?, ?, ?)  [["species", "Greek Yogurt"], ["created_at", "2020-11-02 20:58:45.892230"], ["updated_at", "2020-11-02 20:58:45.892230"]]

  def edit
    @pumpkin = Pumpkin.find(params[:id])
---
SELECT "pumpkins".* FROM "pumpkins" WHERE "pumpkins"."id" = ? LIMIT ?  [["id", 78], ["LIMIT", 1]]

  def update
    @pumpkin = Pumpkin.find(params[:id])
    @pumpkin.update(pumpkin_params)
---
SELECT "pumpkins".* FROM "pumpkins" WHERE "pumpkins"."id" = ? LIMIT ?  [["id", 126], ["LIMIT", 1]]
UPDATE "pumpkins" SET "species" = ?, "updated_at" = ? WHERE "pumpkins"."id" = ?  [["species", "Boba Tea"], ["updated_at", "2020-11-02 21:40:38.978918"], ["id", 126]]