pumpkin-patch/app/views/pumpkins/new.html.erb

<%=f.label :pumpkin_farm %>
<%=f.collection_check_boxes :pumpkin_farm_ids, PumpkinFarm.all, :id, :name %>
---
SELECT "pumpkin_farms".* FROM "pumpkin_farms"