pumpkin-patch/app/views/pumpkins/show.html.erb

<div>
    Availabe at:<% @pumpkin.pumpkin_farms.each do |farm| %>
---
SELECT "pumpkins".* FROM "pumpkins" WHERE (1) LIMIT ?  [["LIMIT", 1]]